{
  "title": "Week 3 Notes",
  "cells": [
    {
      "type": "text",
      "data": "<h1><span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><b><font color=\"#000000\">The Agile Manifesto</font></b></span></h1><p><span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><b><font color=\"#4f8f00\">Individuals and interactions</font></b>&nbsp;</span><span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><font color=\"#941100\">over processes and tools</font><br></span><font color=\"#4f8f00\"><span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><b>Working software</b></span>&nbsp;</font><span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><font color=\"#941100\">over comprehensive documentation</font><br></span><span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><b><font color=\"#4f8f00\">Customer collaboration</font></b></span>&nbsp;<span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><font color=\"#941100\">over contract negotiation</font><br></span><span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><b><font color=\"#4f8f00\">Responding to change</font></b></span>&nbsp;<span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><font color=\"#941100\">over following a plan</font></span></p><p><span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><font color=\"#000000\"><b><br></b></font></span></p><h2><span style=\"orphans: 2; text-align: -webkit-center; widows: 2;\"><font color=\"#000000\"><b>Principles behind the Agile Manifesto</b></font></span></h2><p style=\"font-variant-ligatures: normal;\"><ol><li>Our highest priority is to satisfy the customer&nbsp;through early and continuous delivery&nbsp;of valuable software.<br></li><li>Welcome changing requirements, even late in development. Agile processes harness change for&nbsp;the customer's competitive advantage.<br></li><li>Deliver working software frequently, from a&nbsp;couple of weeks to a couple of months, with a&nbsp;preference to the shorter timescale.<br></li><li>Business people and developers must work&nbsp;together daily throughout the project.<br></li><li>Build projects around motivated individuals.&nbsp;Give them the environment and support they need,&nbsp;and trust them to get the job done.<br></li><li>The most efficient and effective method of&nbsp;conveying information to and within a development&nbsp;team is face-to-face conversation.<br></li><li>Working software is the primary measure of progress.<br></li><li>Agile processes promote sustainable development.&nbsp;The sponsors, developers, and users should be able&nbsp;to maintain a constant pace indefinitely.<br></li><li>Continuous attention to technical excellence&nbsp;and good design enhances agility.<br></li><li>Simplicity--the art of maximizing the amount&nbsp;of work not done--is essential.<br></li><li>The best architectures, requirements, and designs&nbsp;emerge from self-organizing teams.<br></li><li>At regular intervals, the team reflects on how&nbsp;to become more effective, then tunes and adjusts&nbsp;its behavior accordingly.<br></li></ol></p><hr><span style=\"font-variant-ligatures: normal; orphans: 2; text-align: -webkit-center; widows: 2;\"></span>"
    },
    {
      "type": "text",
      "data": "<h2><b>Questions</b></h2><div><div><span style=\"orphans: 2; widows: 2;\"><font color=\"#ff0000\"><b>Why is SCRUM the most common or popular Agile method?</b></font></span></div><div><div><font color=\"#000000\">What is Scrum?</font>&nbsp;Scrum is a tool used to organize work into small, manageable pieces that can be completed by a cross-functional team within a prescribed time period.</div><div style=\"orphans: 2; widows: 2;\"><font color=\"#000000\"><br></font></div><div style=\"orphans: 2; widows: 2;\"><font color=\"#000000\">There are a lot of user cases available, this&nbsp;demonstrates that it is successful and popular. This means there is a lot of documentation and support for its application and functionality.</font></div><div style=\"orphans: 2; widows: 2;\"><font color=\"#000000\"><br></font></div><div style=\"orphans: 2; widows: 2;\"><font color=\"#000000\">Scrum supports certifications by the Scrum&nbsp;Alliance, which gives users access to practisoners and trainers of Scrum.</font></div><div style=\"orphans: 2; widows: 2;\"><font color=\"#000000\">The framework is mature, as its been around for some time now, it also suppliers continued feedback from clients, developer and all kinds of stakeholders.</font></div><div style=\"orphans: 2; widows: 2;\"><font color=\"#000000\"><br></font></div><div style=\"orphans: 2; widows: 2;\"><font color=\"#000000\">Other benefits include:</font></div><div style=\"orphans: 2; widows: 2;\"><ul style=\"box-sizing: border-box; margin: 0px 0px 10px 20px; padding: 0px; font-variant-ligatures: normal;\"><li style=\"box-sizing: border-box;\">Feedback gathered from stakeholders, customers and end users throughout the process of development</li><li style=\"box-sizing: border-box;\">Fast reaction to changing requirements</li><li style=\"box-sizing: border-box;\">1-4 week sprints provide a sense of urgency, increasing the dev team's velocity</li><li style=\"box-sizing: border-box;\">Shippable increments delivered early and often, enabling stakeholders to provide feedback</li><li style=\"box-sizing: border-box;\">Productive, effective, and efficient meetings (daily Scrum meetings and retrospectives) help ensure that developers get help when they need it</li></ul></div><div style=\"orphans: 2; widows: 2;\"><font color=\"#000000\">Having additional face to face meeting means work isn’t lost, its easier to stay on track with your progress and expectations, you have greater contact with other team members.</font></div><div style=\"orphans: 2; widows: 2;\"><font color=\"#000000\">&nbsp;</font></div><div>The focus on productivity in such a fast-paced environment could lead to burnout, but with self-governance and more involvement in management processes as well as day-to-day meetings that (ideally) encourage honest and open communication, Scrum teams enjoy a supportive climate that focuses on positive reinforcement and removing impediments rather than pointing fingers.</div><div style=\"orphans: 2; widows: 2;\"><br></div><span style=\"orphans: 2; widows: 2;\"><font color=\"#ff0000\"><b>Why have different sub-methods of Agile come into being?</b></font></span></div><div><div style=\"orphans: 2; widows: 2;\">Each methodology have different focus, even though there core is similar, they all follow the 12 values of the Agile Manifesto. For example XP is very customer focused, integrating the customer into the project at all times, whereas some don’t have as much of a customer focus.</div><div style=\"orphans: 2; widows: 2;\"><br></div><span style=\"orphans: 2; widows: 2;\"><font color=\"#ff0000\"><b>Why are non-project elements of an organisation sometimes suspicious of Agile thinking?</b></font></span></div><div><div style=\"orphans: 2; widows: 2;\"><br></div><div style=\"orphans: 2; widows: 2;\"><br></div><span style=\"orphans: 2; widows: 2;\"><font color=\"#ff0000\"><b>What is envision – speculate – explore – adapt – close?</b></font></span></div><div><div style=\"orphans: 2; widows: 2;\">These are the steps in the Agile Project Management framework and it describes the entire lifecycle of the APM.</div><div style=\"orphans: 2; widows: 2;\"><br></div><div style=\"orphans: 2; widows: 2;\">The<b> Envision </b>stage, identifies key members involved in the project, they will create a compelling vision for the project. They also identify customer visions, key capabilities, set business objectives for the project, identifiy the right participates andstakes holders of the project, and finally how the team will delivery the project.</div><div style=\"orphans: 2; widows: 2;\"><br></div><div style=\"orphans: 2; widows: 2;\">The second stage in the life cycle is the <b>speculate</b> stage, the product vision is translated, the approach to meet the requirements is devised, and the release plan is put forward.</div><div style=\"orphans: 2; widows: 2;\">There are two key activities:</div><div style=\"orphans: 2; widows: 2;\"><ol><li>The team must come up with the initial understanding of the project requirements, each of the features will be drilled down into user stories to ensure a better understanding, and priorities have to created so the team knows what to start on first.</li><li>The second part is a high-level milestone plan that speculates how long those features will take.<span style=\"text-align: justify;\">This planning happens at multiple levels such as release level, wave level and iteration level.</span></li></ol></div><div>The third stage is the <b>Explore</b> stage, this is like it sounds and is used to test alternatives to impliment and fulfil the project requirements. This process also have the testing and work deliveries tale place. Here the product vision needs ot be translated to a release plan.&nbsp;</div><div><span style=\"text-align: justify;\">The team works in an iterative manner in the explore phase that means, they take a sub-set of the product’s features or stories and accept it into a plan for an iteration. Then it will proceed to work on the development for the stories. It goes hand-in-hand with the adapt phase, wherein the team learns from the experiences of development and the feedback from the customer.</span><br></div><div><span style=\"text-align: justify;\"><br></span></div><div><span style=\"text-align: justify;\">During the&nbsp;<b>Adapt</b> phase the Agile team review the results of the execution, the current situation and the performace of the team against the project expectations. Adaption can also mean a changing of approach,&nbsp;</span><span style=\"orphans: 2; text-align: justify; widows: 2;\">changing the process, changing the environment, changing the project’s objectives and so on as per the requirements of the customers.</span></div><div><span style=\"orphans: 2; text-align: justify; widows: 2;\"><br></span></div><div><span style=\"orphans: 2; text-align: justify; widows: 2;\">The final phase is the <b>Close </b>phase,&nbsp;</span><span style=\"orphans: 2; text-align: justify; widows: 2;\">This is the last phase within agile project management framework. It concludes the project in an ordered manner capturing the project’s key lessons.</span></div><div style=\"orphans: 2; widows: 2;\"><br></div><span style=\"orphans: 2; widows: 2;\"><font color=\"#ff0000\">How is the Agile “lifecycle” different from the agile processes?</font></span><br></div></div><div><span style=\"orphans: 2; widows: 2;\"><font color=\"#ff0000\"><br></font></span></div><div><span style=\"orphans: 2; widows: 2;\"><font color=\"#ff0000\"><br></font></span></div><div><span style=\"orphans: 2; widows: 2;\"><font color=\"#ff0000\"><br></font></span></div><div><hr></div>"
    },
    {
      "type": "text",
      "data": "<h2><b>Topic Mastery</b></h2><div><span style=\"orphans: 2; widows: 2;\">Know the fundamentals of the core Agile model.</span><br><span style=\"orphans: 2; widows: 2;\">Be familiar with the differences between Lean, Kanban, XP and SCRUM.</span><br><span style=\"orphans: 2; widows: 2;\">Understand what is common among all agile sub-methods.</span><br></div><div><hr></div>"
    },
    {
      "type": "text",
      "data": "<h2 style=\"margin: 20px 0px 10px; line-height: 1.4; text-rendering: optimizeLegibility; font-variant-ligatures: normal;\">Extreme Programming (XP)</h2><p style=\"margin: 0px 0px 20px; font-variant-ligatures: normal;\">XP has received the lion's share of interest among agile methods. XP drew attention because it converged with many of the practices that developers were discovering in real project work and because its initial successes, including the well-known&nbsp;<a href=\"http://en.wikipedia.org/wiki/Chrysler_Comprehensive_Compensation_System\" target=\"_blank\" style=\"cursor: pointer;\">Chrysler Comprehensive Compensation project</a>, coincided with the Internet movement, with its need for an approach geared to speed-to-value and exploratory, innovative projects.</p><p style=\"margin: 0px 0px 20px; font-variant-ligatures: normal;\">XP is unique among the agile methods surveyed here because it is focused on software development, and it is not presented as a project methodology. XP doesn't scale to teams larger than 10 or so, and it's not well suited to virtual or dispersed teams.</p><p style=\"margin: 0px 0px 20px; font-variant-ligatures: normal;\">XP is presented as a series of principles that agile developers should follow. These elements include the following:</p><ul type=\"disc\" style=\"margin: 0px 0px 20px 25px; padding: 0px; font-variant-ligatures: normal; orphans: 2; widows: 2;\"><li>The planning game:&nbsp;A recurrent workshop in which developers and customers interact in order to create and refine the \"stories\" that describe their project.</li><li>Small releases with high-value elements: \"Every release should be as small as possible, containing the most valuable business requirements.\" - Kent Beck</li><li>Metaphor:&nbsp;The overall idea of the project; the broad goal told as a narrative or story to keep the technical jargon to a minimum and build a collaborative vision between developers and customers.</li><li>Simplicity: The ideal of simplicity is central to XP. The delivered product itself should be simple, delivering the needed features in the simplest manner without trying to speculate about the bells and whistles that might be useful sometime in the future. The use of methodology and technique should be simple too; XP developers avoid documentation, other than stories and test cases, unless there's a convincing demonstration of their value to the customer. XP practitioners strive for elegance and simplicity in their actual coding practices, which leads us to&nbsp;<a href=\"https://www.techrepublic.com/downloads/5138-10548-5642838.html\" target=\"_blank\" style=\"cursor: pointer;\">refactoring</a>.</li><li>Refactoring: Refactoring is the optimization of the internal code and architecture of software, and it's a key element of XP. It's also a response to one of the hazards of iterative design, the danger that the separate iterations will be poorly integrated and internally incompatible. Refactoring is a disciplined approach to rebuilding system internals to ensure simplicity, elegance, and compatibility.</li><li>Pair programming:&nbsp;Pair programming takes the concept of software inspections and walk-throughs to the next level. Rather than periodic reviews, the key insight of pair programming is that two skilled practitioners can review and optimize each other's code and each other's coding practices, as they work toward the customer's goal.</li><li>Testing: The vital difference between XP testing practices and traditional practices is that XP insists that test cases for all features be developed up front, with the stories.</li><li>Continuous builds: Going beyond the \"daily build\" that's a common practice in many commercial software companies, XP practitioners prefer the continuous build, ensuring compatibility and functionality continuously as the product is created.</li><li>Sustainable development:&nbsp;A reaction to the 70-hour week \"death march\" project that many developers have experienced, the 40-hour-week standard that XP espouses is consistent with the agile philosophy that creative developers do their best work when they're committed, energized, clear, and focused.</li><li>Available customer: XP calls for the customer to be completely integrated with the development team; available to review features, builds, and tests; and to review, assess, and optimize the product as it evolves.</li></ul><p style=\"margin: 0px 0px 20px; font-variant-ligatures: normal;\">XP's broad exposure, and the debate it has engendered, has given the project management and software development communities the chance to consider these ideas and to explore their applicability to their work.</p><p style=\"margin: 0px 0px 20px; font-variant-ligatures: normal;\"><i>Found here:&nbsp;<a href=\"https://www.techrepublic.com/blog/tech-decision-maker/four-variants-of-agile-development-methods/\">https://www.techrepublic.com/blog/tech-decision-maker/four-variants-of-agile-development-methods/</a></i></p>"
    }
  ]
}